src/Catalogs/ОбнаружениеИнцидентов/ОбнаружениеИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОбнаружениеИнцидентов</name>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ТекстОповещения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсполняющееЗадание</name>
    <type>
      <types>CatalogRef.ОчередьЗаданий</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловиеПоказателей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипИнцидента</name>
    <type>
      <types>CatalogRef.ТипыИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипОбнаружения</name>
    <type>
      <types>EnumRef.ТипыОбнаруженияИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрПоказателя1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрПоказателя2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрПоказателя3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Функция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаРасчета</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Сравнение</name>
    <type>
      <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеБазы</name>
    <type>
      <types>EnumRef.ВариантыСмещенияБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическоеДобавлениеПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапросОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиОтбора</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РегулярноеВыражениеЗамены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ТипыИнцидентов/ТипыИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыИнцидентов</name>
  <attributes>
    <name>Подсистема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньИнцидента</name>
    <type>
      <types>EnumRef.УровниИнцидентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокАдм</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектЦКК</name>
    <type>
      <types>CatalogRef.КонтрольныеПроцедуры</types>
      <types>CatalogRef.ОбнаружениеИнцидентов</types>
      <types>CatalogRef.ОбъектыКонтроля</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешТипа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ПоказателиИнцидентов/ПоказателиИнцидентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПоказателиИнцидентов</name>
  <owners>Catalog.ОбнаружениеИнцидентов</owners>
  <attributes>
    <name>Функция</name>
    <type>
      <types>EnumRef.ФункцииОповещений</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.ЧислоНовыхОбъектов</types>
      <types>CatalogRef.ЧислоПаденийРабочихПроцессов</types>
      <types>CatalogRef.ЧислоСеансовПользователей</types>
      <types>CatalogRef.ИспользованиеОперативнойПамятиПроцессамиКластера</types>
      <types>CatalogRef.ПоказателиAPDEX</types>
      <types>CatalogRef.СкоростьРазбораПроблем</types>
      <types>CatalogRef.ТекущееЧислоВызововСервера</types>
      <types>CatalogRef.ЧислоИсключенийПоТехнологическомуЖурналу</types>
      <types>CatalogRef.ОценкаПользователей</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеБазы</types>
      <types>CatalogRef.СформированоОтчетов</types>
      <types>CatalogRef.ПоказателиСкоростиВыполненияТипичныхОпераций</types>
      <types>CatalogRef.ЧислоНерешенныхПроблем</types>
      <types>CatalogRef.ПроцентДоступностиСервисаВсеРесурсы</types>
      <types>CatalogRef.ПоказателиСчетчиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалРасчета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаРасчета</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>СравниватьСПрошлым</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СмещениеБазы</name>
    <type>
      <types>EnumRef.ВариантыСмещенияБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ИнтервалБазы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаВремениИнтервалаБазы</name>
    <type>
      <types>EnumRef.ЕдиницыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСравнения</name>
    <type>
      <types>EnumRef.ВидыСравненияПоказателейОповещения</types>
    </type>
  </attributes>
  <attributes>
    <name>Порог</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогВПроцентах</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматнаяСтрокаЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПорогДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ОбнаружениеИнцидентов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтотОбъект.ДополнительныеСвойства.Свойство("ОбновлениеИБ") И ЭтотОбъект.ДополнительныеСвойства.ОбновлениеИБ Тогда
		Возврат;
	КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ТипИнцидента) Тогда
        ТипИнцидента = Справочники.ТипыИнцидентов.СоздатьЭлементПоНаименованию("ЦКК.Показатели." + Наименование, Справочники.ТипыИнцидентов.ПараметрыСозданияПоУмолчанию(Ответственный, УровеньИнцидента, Ссылка));
    КонецЕсли;
    
	Если НЕ ПроверитьУникальностьНаименования() Тогда
		ВызватьИсключение "Не уникальное наименование";
    КонецЕсли;
               	
	Если ДополнительныеСвойства.Свойство("Расписание") Тогда
		УстановитьРасписание(ДополнительныеСвойства.Расписание, ДополнительныеСвойства.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
   	
	Если ДополнительныеСвойства.Свойство("ПоказателиИнцидентовУдалить") Тогда
		Для Каждого ТекПоказательИнцидента Из ДополнительныеСвойства.ПоказателиИнцидентовУдалить Цикл
			ПоказательИнцидентаОбъект = ТекПоказательИнцидента.ПолучитьОбъект();
            Если ПоказательИнцидентаОбъект <> Неопределено Тогда
                ПоказательИнцидентаОбъект.Удалить();
            КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИсполняющееЗадание = Неопределено;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЗначениеЗаполнено(ТипИнцидента) И ЭтоКрайнееОбнаружение() Тогда
		Запись = ТипИнцидента.ПолучитьОбъект();
		Если Запись <> Неопределено Тогда
			Запись.Удалить();
		КонецЕсли;
	КонецЕсли;
	
	Если Общий.СсылкаСуществует(ИсполняющееЗадание) Тогда
		ИсполняющееЗадание.ПолучитьОбъект().Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьРасписание(Знач Расписание, Знач ТекущийОбъектСсылка)
	
	Если Общий.СсылкаСуществует(ИсполняющееЗадание) Тогда
		ОчередьЗаданий.ИзменитьЗадание(ИсполняющееЗадание, Новый Структура("Расписание, Использование",	Расписание, ИсполняющееЗадание.Использование));
	Иначе
		ПараметрыСоздания = Новый Структура;
		
		ПараметрыЗадания = Новый Массив;
		ПараметрыЗадания.Добавить(ТекущийОбъектСсылка);
		ПараметрыСоздания.Вставить("НавигационнаяСсылкаВладельцаЗадания", ПолучитьНавигационнуюСсылку(ТекущийОбъектСсылка));
		ПараметрыСоздания.Вставить("Использование", Ложь);
		ПараметрыСоздания.Вставить("Расписание", Расписание);
		ПараметрыСоздания.Вставить("ИмяМетода", "Справочники.ОбнаружениеИнцидентов.ВыполнитьЗамер");
		ПараметрыСоздания.Вставить("Параметры", ПараметрыЗадания);
		ПараметрыСоздания.Вставить("Наименование", Наименование);
				
		ИсполняющееЗадание = ОчередьЗаданий.ДобавитьЗадание(ПараметрыСоздания);
	КонецЕсли;
	
КонецПроцедуры

// Проверяет корректность заполнения данных перед включением оповещения
//
// Параметры:
//  СообщатьОбОшибках - Булево - признак того, что нужно формировать сообщения о незаполненных полях
//
// Возвращаемое значение:
//  Булево
//
Функция ПроверитьКорректностьЗаполнения(Знач СообщатьОбОшибках) Экспорт
	
	Результат = Истина;
	Если ИсполняющееЗадание = Неопределено Тогда
		Если СообщатьОбОшибках Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "РасписаниеПредставление";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Текст = "Укажите расписание!";
			Сообщение.Сообщить();
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПоказателиИнцидентов.Ссылка
	               |ИЗ
	               |	Справочник.ПоказателиИнцидентов КАК ПоказателиИнцидентов
	               |ГДЕ
	               |	ПоказателиИнцидентов.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", Ссылка);
	Если Запрос.Выполнить().Пустой() Тогда
		Если СообщатьОбОшибках Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Поле = "Показатели";
			Сообщение.Текст = "Укажите хотя бы один показатель!";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
		КонецЕсли;
		Результат = Ложь;
	КонецЕсли;
		
	Возврат Результат;
	
КонецФункции

Функция ПроверитьУникальностьНаименования()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Количество(*) КАК КоличествоЭлементов
	|ИЗ
	|	Справочник.ОбнаружениеИнцидентов
	|ГДЕ
	|	Наименование = &Наименование
	|	И Ссылка <> &Ссылка
    |   И ТипИнцидента <> &ТипИнцидента
	|";
	
	Запрос.УстановитьПараметр("Наименование", ЭтотОбъект.Наименование);
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
    Запрос.УстановитьПараметр("ТипИнцидента", ЭтотОбъект.ТипИнцидента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат ?(Выборка.КоличествоЭлементов = 0, Истина, Ложь);
	
КонецФункции

Функция ЭтоКрайнееОбнаружение()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Ссылка) КАК Количество
	|ИЗ
	|	Справочник.ОбнаружениеИнцидентов
	|ГДЕ
	|	Ссылка <> &Ссылка
	|	И ТипИнцидента = &ТипИнцидента
	|";
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("ТипИнцидента", ЭтотОбъект.ТипИнцидента);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Количество() = 0; 
	
КонецФункции


#КонецОбласти

#КонецЕсли
